{
    "days": [{
            "day": 1,
            "text": "In the beginning the Word already existed. The Word was with God, and the Word was God. He existed in the beginning with God. God created everything through him, and nothing was created except through him. The Word gave life to everything that was created, and his life brought light to everyone. The light shines in the darkness, and the darkness can never extinguish it.",
            "verse": "John 1:1-5 NLT"
        },
        {
            "day": 2,
            "text": "In the sixth month of Elizabeth’s pregnancy, God sent the angel Gabriel to Nazareth, a village in Galilee, to a virgin named Mary. She was engaged to be married to a man named Joseph, a descendant of King David. Gabriel appeared to her and said, \"Greetings, favored woman! The Lord is with you!\"...\"You will conceive and give birth to a son, and you will name him Jesus.\"",
            "verse": "Luke 1:26-28, 31 NLT"
        },
        {
            "day": 3,
            "text": "This is how Jesus the Messiah was born. His mother, Mary, was engaged to be married to Joseph. But before the marriage took place, while she was still a virgin, she became pregnant through the power of the Holy Spirit.",
            "verse": "Matthew 1:18 NLT"
        },
        {
            "day": 4,
            "text": "As he considered this, an angel of the Lord appeared to him in a dream. \"Joseph, son of David,\\” the angel said, \"do not be afraid to take Mary as your wife. For the child within her was conceived by the Holy Spirit. And she will have a son, and you are to name him Jesus, for he will save his people from their sins.\"",
            "verse": "Matthew 1:20-21 NLT"
        },
        {
            "day": 5,
            "text": "\"All of this occurred to fulfill the Lord’s message through his prophet:\n \"Look! The virgin will conceive a child!\nShe will give birth to a son,\nand they will call him Immanuel,\nwhich means ‘God is with us.\n’\"",
            "verse": "Matthew 1:22-23 NLT"
        },
        {
            "day": 6,
            "text": "And because Joseph was a descendant of King David, he had to go to Bethlehem in Judea, David’s ancient home. He traveled there from the village of Nazareth in Galilee.",
            "verse": "Luke 2:4 NLT"
        },
        {
            "day": 7,
            "text": "He took with him Mary, to whom he was engaged, who was now expecting a child.",
            "verse": "Luke 2:5 NLT"
        },
        {
            "day": 8,
            "text": "But you, O Bethlehem Ephrathah,\n are only a small village among all the people of Judah. \n Yet a ruler of Israel,\n  whose origins are in the distant past,\n will come from you on my behalf.",
            "verse": "Micah 5:2 NLT"
        },
        {
            "day": 9,
            "text": "And while they were there, the time came for her baby to be born. She gave birth to her firstborn son...",
            "verse": "Luke 2:6-7 NLT"
        },
        {
            "day": 10,
            "text": "She gave birth to her firstborn son. She wrapped him snugly in strips of cloth and laid him in a manger, because there was no lodging available for them.",
            "verse": "Luke 2:7 NLT"
        },
        {
            "day": 11,
            "text": "For a child is born to us,\na son is given to us.\nThe government will rest on his shoulders.\nAnd he will be called:\nWonderful Counselor, Mighty God,\nEverlasting Father, Prince of Peace.",
            "verse": "Isaiah 9:6 NLT"
        },
        {
            "day": 12,
            "text": "That night there were shepherds staying in the fields nearby, guarding their flocks of sheep. Suddenly, an angel of the Lord appeared among them, and the radiance of the Lord’s glory surrounded them. They were terrified, but the angel reassured them. \"Don’t be afraid!\" he said. \"I bring you good news that will bring great joy to all people. The Savior—yes, the Messiah, the Lord—has been born today in Bethlehem, the city of David!\"",
            "verse": "Luke 2:8-11 NLT"
        },
        {
            "day": 13,
            "text": "And you will recognize him by this sign: You will find a baby wrapped snugly in strips of cloth, lying in a manger.",
            "verse": "Luke 2:12 NLT"
        },
        {
            "day": 14,
            "text": "Suddenly, the angel was joined by a vast host of others—the armies of heaven—praising God and saying,\n\"Glory to God in highest heaven,\nand peace on earth to those with whom God is pleased.\"",
            "verse": "Luke 2:13-14 NLT"
        },
        {
            "day": 15,
            "text": "When the angels had returned to heaven, the shepherds said to each other, \"Let’s go to Bethlehem! Let’s see this thing that has happened, which the Lord has told us about.\"\nThey hurried to the village and found Mary and Joseph. And there was the baby, lying in the manger. After seeing him, the shepherds told everyone what had happened and what the angel had said to them about this child. All who heard the shepherds’ story were astonished",
            "verse": "Luke 2:15-18 NLT"
        },
        {
            "day": 16,
            "text": "Come, let us worship and bow down.\nLet us kneel before the Lord our maker",
            "verse": "Psalm 95:6 NLT"
        },
        {
            "day": 17,
            "text": "but Mary kept all these things in her heart and thought about them often. The shepherds went back to their flocks, glorifying and praising God for all they had heard and seen. It was just as the angel had told them...Jesus’ parents were amazed at what was being said about him. Then Simeon blessed them, and he said to Mary, the baby’s mother, \"This child is destined to cause many in Israel to fall, and many others to rise. He has been sent as a sign from God, but many will oppose him. As a result, the deepest thoughts of many hearts will be revealed. And a sword will pierce your very soul.\"",
            "verse": "Luke 2:19-20, 33-35 NLT"
        },
        {
            "day": 18,
            "text": "Eight days later, when the baby was circumcised, he was named Jesus, the name given him by the angel even before he was conceived.",
            "verse": "Luke 2:21 NLT"
        },
        {
            "day": 19,
            "text": "Then it was time for their purification offering, as required by the law of Moses after the birth of a child; so his parents took him to Jerusalem to present him to the Lord. The law of the Lord says, \"If a woman’s first child is a boy, he must be dedicated to the Lord.\" So they offered the sacrifice required in the law of the Lord—\"either a pair of turtledoves or two young pigeons.\"",
            "verse": "Luke 2:22-24 NLT"
        },
        {
            "day": 20,
            "text": "One day when the crowds were being baptized, Jesus himself was baptized. As he was praying, the heavens opened, and the Holy Spirit, in bodily form, descended on him like a dove. And a voice from heaven said, \"You are my dearly loved Son, and you bring me great joy.\"",
            "verse": "Luke 3:21-22 NLT"
        },
        {
            "day": 21,
            "text": "At that time there was a man in Jerusalem named Simeon. He was righteous and devout and was eagerly waiting for the Messiah to come and rescue Israel. The Holy Spirit was upon him and had revealed to him that he would not die until he had seen the Lord’s Messiah. That day the Spirit led him to the Temple. So when Mary and Joseph came to present the baby Jesus to the Lord as the law required, Simeon was there. He took the child in his arms and praised God, saying,\n\"Sovereign Lord, now let your servant die in peace,\nas you have promised.\nhave seen your salvation,\nwhich you have prepared for all people.\nHe is a light to reveal God to the nations,\nand he is the glory of your people Israel!\"",
            "verse": "Luke 2:25-32 NLT"
        },
        {
            "day": 22,
            "text": "Jesus was born in Bethlehem in Judea, during the reign of King Herod. About that time some wise men from eastern lands arrived in Jerusalem",
            "verse": "Matthew 2:1 NLT"
        },
        {
            "day": 23,
            "text": "Jesus was born in Bethlehem in Judea, during the reign of King Herod. About that time some wise men from eastern lands arrived in Jerusalem, asking, \"Where is the newborn king of the Jews? We saw his star as it rose, and we have come to worship him.\"",
            "verse": "Matthew 2:1-2 NLT"
        },
        {
            "day": 24,
            "text": "After this interview the wise men went their way. And the star they had seen in the east guided them to Bethlehem. It went ahead of them and stopped over the place where the child was. When they saw the star, they were filled with joy!",
            "verse": "Matthew 2:9-10 NLT"
        },
        {
            "day": 25,
            "text": "They entered the house and saw the child with his mother, Mary, and they bowed down and worshiped him. Then they opened their treasure chests and gave him gifts of gold, frankincense, and myrrh.",
            "verse": "Matthew 2:11 NLT"
        }
    ]
}